# 정수형
a = 123
print(a)
a = -123
print(a)
a = 0
print(a)

print()
print()
# 실수형
a = 1.2
print(a)
a = -3.45
print(a)
a = 4.24E10 # 4.24 * 10의 10제곱을 의미.
print(a)
a = 4.24e-10 # 4.24 * 10의 -10제곱을 의미.
print(a) # 지수 표기법으로 출력. 너무 작은 수는 출력하려고 하지 않음.

print()
print()
# 8진수와 16진수
a = 0o177 # 1*8**2 + 7*8**1 + 7*8**0 = 64 + 56 + 7 = 127
print(a)
# 0 1 2 3 4 5 6 7 8 9 A B C D E F
a = 0x8ff # 8*16**2 + 15*16**1 + 15*16**0 = 2048 + 240 + 15 = 2303
print(a)
b = 0xABC # A*16**2 + B*16**1 + C*16**0 = 2560 + 176 + 12 = 2748
print(b) # 10*16**2 + 11*16**1 + 12*16**0 = 2560 + 176 + 12 = 2748
